{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/ornamental",
  "1.12.2": {
    "1.2": "• Whoops, that was not Vanilla, that looks more like Twilight Forest compatibility.\n     • Ironwood Fences, Stairs, and Slabs. For those who want more than wood, but less than iron.\n     • Fiery Fences, Stairs, and Slabs. It's perfect for heating your home during Winter!\n     • Steeleaf Fences, Slabs, and Stairs. It's the natural alternative for fine steel!\n     • Arctic Fur Fences, Slabs, and Stairs. The soft and cushiony blocks are perfect for those who are a little faithful to the leap.\n    • Carminite Fences, Slabs, and Stairs. Whatever it is, how well does it bode as something durable?\n    • As a note, these blocks will persist without Twilight Forest installed. This is perfectly normal behaviour.\n • Silly me, that wasn't the right thing to put into the Mod Info. The players are aware that this version is for 1.12.2, but what about the mod itself?\n • Maybe I should let players know what to expect in updates to this mod?",
    "1.3": "Here, have an early Christmas present.\n • Added Coal Stairs, Slabs, and Fences. Only for the naughtiest builders, but viable Furnace fuel.\n • Added Redstone Stairs, Slabs, and Fences. Each with their own emission rates, I want to see some clever Redstone builds.\n • Added ■■■■■■■■■ Stairs, Slabs, and Fences. Wait, what's happening?\n • Couple more behind the scenes changes that nobody should really care about.",
    "1.4": "New year, new stuff for Nifty.\n • Added Nifty Fence Gates and gave them to each material. Now you have a compliment for that farm with Nifty Fencing.\n • Added Nifty Trapdoors and gave them to each material. Some of them won't budge without encouragement, others will slip right open, like traps.\n • Fixed Ironwood Nifty Blocks being usable as Furnace fuel, because apparently anything wooden is fuel in Minecraft.\n • For various reasons, I have removed any Twilight Forest Textures that weren't the two 'safe' textures. You'll now get Missing Nifty Textures when Twilight Forest isn't installed.\n • Not that anyone should care, but I made tidier code.",
    "1.5": "Yeah, now I'm really picking up where Mojang left off.\n • Added Dirt Nifty Blocks. Start out your flaunting adventure by pimping up your Dirt house.\n • Added Grass Nifty Blocks. A greener alternative to Dirt houses, and self-sustaining.\n • Grass and Dirt Nifty blocks don't decay or grow, so they maintain their form in builds. To change between the two, use a Shovel or Bone Meal.\n • Added Hay Nifty Blocks. I'm surprised there wasn't some sort of Hay Stairs or Hay Slab in Minecraft already; now I know.\n • By popular demand and asked by nobody, added Clay Nifty Blocks. They were already a thing in 2.1, but I'll bring it here.\n • I may have gone a little far, and decided to add The Betweenlands compat. This includes Octine, Syrmorite, Valonite, Scabyst, and Sulfur Nifty Blocks.\n • Fixed Nifty Slab behaviour. They didn't drop anything if they were full blocks, and pick-blocking a full block yielded nothing.\n • All this time I was doing the Nifty Trapdoor recipes wrong.\n • I want to brag about how much rewriting I did in the background because it looks good, but nobody really cares."
  },
  "1.13.2": {
    "2.0": "Nifty is now out for 1.13.2! Currently, this is just a port of Nifty from 1.12.2, so nothing new has been added. Support for ConnectedTexturesMod and Twilight Forest have been removed as they are not on this version as of publishing. THIS IS NOT A RIFT MOD, PLEASE USE FORGE.",
    "2.1": "• Added Clay Stairs, Slabs, Fences, Trapdoors, and Fence Gates. Nifty was feeling out of balance, so this should fix it up.\n • Removed some leftover console prints. Those were from creating a new project and served no purpose.\n • Guess what? More things I did in the background that nobody should really care about.",
    "2.2": "Still taking up from where Mojang left off here.\n • Added Dirt Nifty Blocks. Start out your flaunting adventure by pimping up your Dirt house.\n • Added Grass Nifty Blocks. A greener alternative to Dirt houses, and self-sustaining.\n • Grass and Dirt Nifty blocks don't decay or grow, so they maintain their form in builds. To change between the two, use a Shovel or Bone Meal.\n • Added Hay Nifty Blocks. I'm surprised there wasn't some sort of Hay Stairs or Hay Slab in Minecraft already; now I know.\n • All this time I was doing the Nifty Trapdoor recipes wrong.\n • I want to brag about how much rewriting I did in the background because it looks good, but nobody really cares."
  },
  "1.14.2": {
    "2.3": "Nifty is now out for 1.14.2! Some textures have been adjusted slightly to fit with the new texture update, but they should be relatively similar to the classic textures. This is just a port of Nifty from 1.13.2, so no new features, and mod compat is still excluded for now. THIS IS NOT A FABRIC MOD. PLEASE USE FORGE."
  },
  "1.14.3": {
    "2.4": "Nifty is now out for 1.14.3! This is mostly just porting up a version, but also includes a couple fixes. First being that later versions of Forge would break the Grass Nifty blocks with their color. The second being that Grass Trapdoors weren't dropping because of an error in the loot table. No new features just yet."
  },
  "1.14.4": {
    "2.5": "Nifty is now out for 1.14.4! Unlike the last couple updates, this does include new features.\n • Added Grass Path Stairs, Slabs, Fences, Trapdoors, and Fence Gates. This one's by popular demand, and most certainly a necessity for 1.14.\n   • Nifty Grass Path blocks are obtained by using a Shovel on any Grass Nifty block. They will keep their form until a Hoe is used on them, where they will revert back to Nifty Grass blocks.\n    • Because of this new feature, obtaining Dirt Nifty blocks now require using a Hoe instead of a Shovel.\n   • As mentioned eariler, Grass Path Nifty blocks will keep their form until a Hoe is used on them, for building convenience.\n • Fixed an issue with Fence blocks not connecting to each other. I'm still not great with this whole datapack thing.\n • The behind-the-scenes tweaks are back, and nobody is required to care still.",
    "2.5.1": "Added a Polish translation for Nifty. Thanks to DarkKnightComes for the translation work.",
    "2.6": "• Added Doors for each available material. Your houses can now be feature complete.\n   • Redstone Doors, unlike other Nifty Redstone blocks, does not emit a Redstone signal, but it has a Comparator output. Open the door with a Comparator nearby to emit a signal.\n • Added a config file. Currently, the only option is disabling Missingno blocks from being obtained. This will not remove them from the world; too invasive of a change.\n • Added Bad Beacon compat. Now if Nifty is installed along with Bad Beacon, Redstone Stairs, Coal Stairs, Lapis Stairs, and Quartz Stairs can be used to build a Bad Beacon pyramid.\n • We're now officially released on a stable version of Forge. Probably doesn't change much.",
    "2.7": "How fitting; spooky-themed blocks for a spooky day.\n • Added Nifty blocks for Bone, Brick, Quartz, Nether Brick, and Red Nether Brick. They needed some love, and I was going to give them that.\n • Coal Doors can now be opened by hand. This was a part of a little rewrite to how doors can be opened, allowing future materials like Bone be opened without Redstone.\n • Absolutely totally destroyed how blockstate and model files are done. They now use Forge Blockstate. \n • Fixed some Clay Nifty block recipes. Now the Doors and Trapdoors can be made with Clay Balls. Don't ask why they were Slabs to start with.\n • Yeah, that's right, I'm dedicating this spot to behind-the-scenes changes that nobody needs to care about. Just know it makes me satisfied.",
    "2.7.1": "Fixed some Stairs models not looking right. When placed upside down, sometimes the model itself wouldn't reflect this.",
    "2.8": "It's now Christmas, which means Nifty is now over a year old now. Here's a fitting update.\n • Added Snow Nifty blocks. Layers of Snow are fun and all, but what about decorative blocks?\n • Added Ice Nifty blocks. Translucent, melts in light just like Ice, and just as slippery.\n • Added Packed Ice Nifty blocks. For an opaque, no-melt solution.\n • Added Blue Ice Nifty blocks. I don't really have any fun quips for Blue Ice; why was it even added outside of feature bloat?\n • All the icy blocks are slippery, however some vanilla logic may make it not slippery. Currently there is no way to control this.\n • All Obsidian Nifty blocks are now immune to being destroyed by the Enderdragon. Make what you will with this fact.\n • Tagged some more blocks. It now uses some more vanilla or Forge Tags, for quality purposes.\n • Look, every time I'm proud of doing something in the background, not everyone cares. You know the drill."
  },
  "1.15.2": {
    "2.9": "Nifty is now out for 1.15.2! This one got quite some changes, mostly for the back-end, but very useful.\n • Added a config option for each material. It's like the option to disable Missingno blocks, but for each type. This is stored in the server config (per save).\n • Created generators for Loot Tables, Blockstates, Models, and Recipes. Won't affect players, but may speed up future development when it happens.\n • Adding the new config gave me the opportunity to make the code much better. Nobody needs to care about this.\n • Some Trapdoor recipes now only require 4 ingredients rather than 6. Thank you Mojang, for your consistency.\n • If another mod or config errors, Nifty will now longer be at fault with block tinting. Still, not my fault.",
    "2.9.1": "Hotfix a crash with running Nifty on dedicated server. It's a weird fix, but it's a fix.",
    "3.0": "We are ready for the next major update for Nifty. I'd say it's pretty big.\n • Added Nifty Golems. This rather ambitious project took me months to complete, and it is finally here. Barring Iron, Snow, and Missingno, every material provided by Nifty has a Golem each.\n • Each Golem has their own creation pattern. Some are like Snow Golems, others are like Iron Golems, and a few with completely different shapes. Check the changelog for 3.0 on Curseforge for more info.\n • Disabling Golem creation is also tied to disabling materials from creation. If Gold decoration blocks are disabled, so are Gold Golems, and so on.\n • Implemented a new system called NiftyBuilder. This is like a 3.0 of registering blocks, but this time it can be used by anybody. By using the provided decoration block classes and creating a material with NiftyBlock, you can make your own addon for Nifty. Details on how to use are documented in the class NiftyBuilder.\n • Removed use of supports_beacon Tag. This was removed by Forge, thus meaning it was useless here.",
    "3.1": "I wrote this changelog because Curseforge corrupted the upload for 3.0 as of writing this. It might even be skipped, so here's a rehashed changelog, plus some extra sounds in some places so I could upload this file. See the changelog for 3.1 on Curseforge for more info."
  },
  "1.16.2": {
    "4.0": "After much deliberation with myself, I have decided that 4.0 will be dedicated to moving Nifty to Ornamental!\n • Added Netherite Ornaments and Golem.\n  • Netherite Ornaments are just like Netherite where they cannot be burned in fire.\n  • Netherite Golems are destructive powerhouses. Beware when creating one, otherwise you might see everything around it burned or destroyed. They can be created with a 2x3 grid of Netherite Blocks with a Carved Pumpkin on top.\n • NiftyBuilder has been renamed to OrnamentBuilder. Fundamentally, it isn't any different from before, but there are changes.\n • Added 'isFireproof'. Helps determine if the item can burn.\n  • Added 'setCanEntitySpawn'. Helps to handle custom spawning logic on the block.\n  • Modified 'tool' so it can check if a block requires a tool to harvest.\n  • Removed 'isBeaconBase'. This is now determined with a vanilla Tag.\n  • For ease of registration, PropertiesHelper can be used to quickly build a Block or Item Property from an OrnamentBuilder.\n • Ornamental will take over old Nifty names. If you load a world that had Nifty, Ornamental will take those mappings and change them, that way you won't lose any progress on construction.\n • Piglins will now guard and love any of the Gold Ornament blocks. Makes sense, really.\n • Added Bone Stairs as a usable base block for the mod Bad Beacon.\n • Plenty of backend changes, but I had lost track of what I did change because the whole mod was renamed.",
    "4.1": "• Changes to OrnamentBuilder:\n   • New methods: 'boneMealToGrass', 'hoeToDirt', 'shovelToPath', 'usePathShapes', 'hoeToGrass', 'canMelt', 'notSolid', 'doBreakableBlockCull', 'pushReactOverride'\n   • New fields: mealGrass, hoeDirt, shovelPath, pathShape, hoeGrass, canMelt, meltResult, canVaporise, isSolid, breakableCull, pushReaction\n    • Deprecated methods: 'isDirtMaterial', 'isGrassMaterial', 'isPathMaterial', 'isIceMaterial'\n    • Deprecated fields: isDirt, isGrass, isPath, isIce\n • Recipe condition ConfigCondition now uses OrnamentBuilder's 'config' method to add valid entries. Should now allow for any config added this way.\n • Fixed some Golems crashing when created from another Golem.\n • Fixed using items on Dirt, Grass, or Path Golems not consuming or damaging the item.\n • Fixed Grass Golems crashing when trying to attack.\n • Fixed particles not appearing for Redstone projectiles and wrong particles for Lapis Lazuli projectiles.\n • Fixed duplication bug with Dirt, Grass, and Path Doors.\n • Fixed converting Grass to Path Fence Gates also causing it to open.\n • Ice ornaments can now be harvested without Silk Touch. This means they can now be broken without turning to Water.\n • Updated required Forge version to fix a few crashes caused by breaking changes."
  },
  "1.16.3": {
    "4.2": "Added support for 1.16.3. Thought it would have, except it wouldn't be because it was told to only work on 1.16.2, no higher, no lower. Should also work on 1.16.2.",
    "4.3": "The next phase for Ornamental: new Blocks! • Added Poles and Beams. All materials in Ornamental have been given this new block.\n   • Poles have 15 variations, ranging from corners to a full block.\n   • Beams have 30 variations, ranging from corners to a full block, facing either North-South or East-West.\n   • All blocks function as quarter blocks. Like Slabs, but smaller.\n • Changes to OrnamentBuilder:\n   • A variation of the burnTime method was added. This one adds two new parameters for Pole and Beam burn times. The previous iteration of this method has been Deprecated, and any use of it will result in Poles and Beams of that material not burning.\n • Modified the shape of upside-down Grass Path Stairs. The bottom part now touches the ground.\n • Fixed some culling issues with Grass Path ornaments. Now the tops won't disappear if another block is placed on top.",
    "4.3.1": "Hotfix a crash where putting Poles or Beams into a Furnace fuel slot would cause a crash. Also, fix a minor visual bug with Missingno Beams looking like Missingno Poles.",
    "4.3.2": "Critical fix caused by slow computers not telling you you're moving files, not copying.",
    "4.4": "No new features for Ornamental, but some cleaning for better compat.\n • Red Nether Brick Fences have now been tagged for Nether Brick Fences.\n • Fixed checks in places for config values. Now if a block has no config option, it will always drop rather than not.\n • Generators now respect that other mods have different mod IDs. This means other mods may now use Ornamental's generators.\n • Recipe generators now respect blocks with no config value. Those that did not would crash the generation, which means no automatically-created recipes.\n Don't forget to keep an eye out for Ornamental: Unusually Decorative, an expansion to Ornamental with more vanilla features."
  },
  "1.16.5": {
    "4.5": "Support has now been moved to 1.16.5 only due to changes implemented.\n • Added Wall ornaments. All materials in Ornamental have been given this new block.\n • Changes to OrnamentBuilder:\n   • A variation of the burnTime method was added. This one adds a new parameter for Wall burn times. The previous iteration of this method has been Deprecated, and any use of it will result in Walls of that material not burning.\n • Entities now handle Attributes properly. This means minimum support is now 1.16.5.\n • Fixed Gold Poles and Beams not tagged under guarded_by_piglins.\n • Fixed Obsidian Poles and Beams not tagged under dragon_immune.\n • Fixed incorrect Lapis Lazuli Fence Gates not having correct recipe.\n • Resolved a conflict with Snow Slab recipe. Now, it is 3 Snow Blocks in a row with any Slab on top.\n • Fixed a model generation error that made certain Beam placements render incorrectly."
  },
  "1.17.1": {
    "4.6": "Ornamental has now been ported to 1.17.1!\n • Added Copper ornaments. These come in 4 varieties: Copper, Exposed Copper, Weathered Copper, and Oxidized Copper. No waxing necessary as they will retain their erosion level. \n • Added Amethyst Ornaments. Just like regular Amethyst Blocks, shooting them with an arrow makes a sound. \n • Added Copper Golem. These large, trusty golems may erode over time, but with enough care, you can remove and prevent their erosion. Charge them up with a strike of lightning for a surprise.\n • Added Amethyst Golem. These strange constructs are capable of casting a flurry of magic at targets. \n • Changes to OrnamentBuilder:\n   • The fields isDirt, isGrass, isPath, and isIce have now been removed. In accordance, the methods isDirtMaterial, isGrassMaterial, isPathMaterial, and isIceMaterial have been removed. Alternative fields are available.\n   • The two Deprecated burnTime methods have now been removed. The current burnTime method requires values for all ornaments.\n   • The fields harvestTool and harvestLevel have been removed in favour of the Tag system. In accordance, the tool method has been renamed to requiresTool and now only sets if a block requires the correct tool.\n   • Added field projectileHitSounds and method projectileHitSound. These accept a list of sounds an ornament will make when hit with an arrow.\n • Grass Path ornaments have now been renamed to Dirt Path to match vanilla. In accordance, Grass Path Golem has been renamed to Dirt Path Golem. Worlds will remain intact.",
    "4.6.1": "Fix an elusive bug that crashes the game on startup."
  },
  "1.18": {
    "4.7": "Ornamental has now been ported to 1.18! This is just a straight port, compat with Bad Beacon has been update to reflect the change in usable material. No changes to OrnamentBuilder has been made, porting should be smooth for addons."
  },
  "1.18.2": {
    "4.8": "Ornamental has now been ported to 1.18.2! Not just a flat port this time, got a new batch of ornaments to play with.\n • Added Saddle Doors. These blocks behave similarly to Doors and Trapdoors. They stand like a Trapdoor placed vertically, and they are placed like Doors, but you can stack as many Saddle Doors on top of each other as you can. Available in all ornament materials. You can craft these by breaking a door down into two halves, or with two Trapdoors lined vertically.\n • Small change to OrnamentBuilder: burnTime now accepts an array of ints instead of several int parameters. Should not cause any breaking changes. Any ornament that attempts to get an invalid burnTime index will now return a burn time of 0 (will not burn), so make sure you update these indices when new ornaments get added.\n • All Snow ornaments are now in the Snow tag. Place these onto Dirt or Grass and they will give them a snowy top.\n • Fixed recipe conflict with Lightning Rod and Copper Poles.\n • Fixed crash when shooting a block with an arrow if they don't emit a sound on impact (any ornament that was not Amethyst).",
    "4.8.1": " • Fixed Stairs causing a crash when placed.\n • Fix Saddle Doors using the wrong burn time.\n • Fix Dirt Path Saddle Doors not being named properly.",
    "4.8.2": " • Fixed a potential crash with burn times not being checked properly."
  },
  "1.19": {
    "4.9.4": "Ornamental has now been ported to 1.19! This version also works with 1.19.1 and 1.19.2, maybe other future 1.19.x versions if they make more fixes.\n • Poles and Beams have been rewritten. There should be no visible change in how they function, however some bugs may still be present. Old worlds with Poles and Beams will not be corrupted, however they will not be visible in the world. Proceed with caution.\n • Ornamental now has a maven. For those that wish to create an addon, instructions will soon be detailed on how to set up Ornamental in your workspace via maven.\n • As part of a recent Forge update, a block's RenderType is now determined by models. Texture pack creators, go ham.\n • Cleaned up block and item model generation. This should now be more streamlined and modular for addon creators.\n • Removed the config file. The only options that existed were disabling features, but this only hid the item from inventories, made items uncraftable, and stopped Golems from forming. As these can be configured with other mods or datapacks, and due to config loading time issues, this configuration feature has been removed.",
    "4.9.8": "Just a few fixed and changes.\n • Fixed an issue with the game not loading on 1.19.\n • Fixed certain Beams not looking correct. This is evidence with blocks such as the Hay Beam where the top is on the side and vice-versa.\n • Mod version is now properly displayed in the mod menu.\n • Quality of life change for addons: fixed item data generation looking in the wrong place in some cases, such as looking for the Fence inventory model provided by Ornamental.",
    "4.9.13": "• Grass Golems now accept all kinds of Small Flowers. This can be controlled with a tag, so now you can plant any plants you want onto your little grassy companion.\n • Created Tags for Poles, Beams, and Saddle Doors. These can be used for datapack purposes, or if a recipe needs to be a little different to prevent recipe conflicts.\n • Fixed Golems having missing textures."
  },
  "1.19.3": {
    "4.10.24": "Ornamental has now been ported to 1.19.3! Plenty of rewriting has been done for further ease of use for addons.\n • Ornamental has been moved to new Creative Tabs. This should make it much easier to find the blocks you want.\n • Improved registry handling. For addon creators, this means you can create a helper to use or modify existing methods, as well as more streamlined tag data generation.",
    "4.10.26": "Fixed an issue with Trapdoors, Fence Gates, Doors, and Saddle Doors not making any sound when opened. Additionally, added properties to OrnamentBuilder for open and close sounds for these blocks.",
    "4.10.39": "• Added ja_jp translation, courtesy of tomodachi94.\n • Add Spawn Eggs for all the Golems.\n • Rewrote RegistryHelper, the new class to extend is MasterRegistryHelper for custom use and fixes possible bugs and compile errors. Check the documentation for more info.",
    "4.10.41": "Fixed a crash on startup."
  },
  "1.19.4": {
    "4.11.56": "Ornamental has now been ported to 1.19.4! Not one but two new catalogues of blocks have been added, enjoy.\n • Added Magma Ornaments. These blocks are hot to the touch and bubble underwater. A spicy addition to your builds.\n • Added Calcite Ornaments. Got too much of this block but nothing to do with it? Why not use it to decorate your base?\n • Added Magma Golem. Hot-headed, these golems will charge into battle hard and fast, burning enemies that it faces. Beware that it will cool down when wet, leave it for a few seconds to reheat.\n • Added Calcite Golem. These peculiar Golems appear passive in nature despite their creepy looks. They seem to have strong dislike of Wardens for some reason, ringing when they sense one nearby before striking.\n • Changes to OrnamentBuilder:\n  • New fields have been added:\n   • blockSetType: Controls SoundType as well as sounds for opening and closing Trapdoors and Doors.\n   • baseBlock: For setting in Stairs, simplifying registration of OrnamentStairs.\n   • light: Sets the light emitted by a block.\n   • postProcess: Sets if the block triggers post-processing in worldgen. Though these blocks are not naturally generating, this is useful for datapacks.\n   • emissiveRender: Determines if the blocks are emissive.\n   • hazardPredicate: A condition for whether a block being stepped on deals damage.\n   • damagePredicate: The type of damage the blocks deal if stepped on.\n   • damageAmount: The amount of damage to deal if stepped on. \n   • createBubbles: determines if the block creates bubble columns. These are not like the base game, but they generally emulate their logic.\n   • extinguishes: Determines if the block hisses when underwater and emitting bubbles.\n   • bubbleDragDown: Sets the bubble column to pull entities down.\n   • tickSchedule: The number of ticks delay when placed in the world.\n  • New methods have been added:\n   • blockSetType: This sets the BlockSetType. A BlockSetType can be provided or a list of parameters can be provided to create a new one.\n   • stairBaseBlock: Sets the base block for an OrnamentStair.\n   • lightLevel: Sets the light value.\n   • doPostProcessing: Enables post processing.\n   • doEmissiveRendering: Enables emissive rendering.\n • floorHazard: Sets if the block can deal damage, the type of damage, and the amount.\n • bubbleUnderwater: Allows bubble columns to be created, if they hiss, if they pull down, and when to start the bubbles.\n  • The fields sound, trapdoorSounds and doorSounds have been removed. In accordance, the methods sound, trapdoorSounds, doorSounds have been removed.\n • Fixed a possible crash when Golems don't have arms.\n • Ice Saddle Doors now melt.\n • Fix Amethyst Pole and Beam recipes so they require Amethyst Slabs."
  },
  "1.20": {
    "4.12.76": "Ornamental has now been updated to 1.20! Some technical updates have been made.\n • Tagged Amethyst Ornaments as vibration resonators.\n • Fixed potential bugs when stepping on certain Ornaments.\n • Fixed Obsidian Golem not swinging arms when attacking.\n • Fixed crafting output amount for Walls.\n • Changes to OrnamentBuilder:\n  • Added a new copy constructor to OrnamentBuilder, which should alleviate technical issues when extending this class.\n  • pushReactOverride is renamed to pushReact. This now sets the PushReaction rather than overriding.\n  • blockSetType now accepts a boolean value for opening ornaments by material.\n  • canOpen now serves as an override. This is a temporary measure due to BlockSetTypes for Stone and Polished Blackstone allowing doors to open by hand, a contradiction to many ornaments.\n  • New canFallThrough method to set if the block will open under an entity when walked on.\n  • canMelt method will now verify if the block passed through is marked as liquid.\n  • New instrument method sets the NoteBlockInstrument a material has when a Note Block is above.\n  • New setRedstoneConduction method sets if a material conducts Redstone. Normally, blocks in Ornamental are non-solid, but this will cover cases where a full block is present.\n  • New setConversionPredicates method allows for setting if one ornament converts to another. This removes boneMealToGrass, hoeToDirt, shovelToPath, and hoeToGrass.\n  • The floorHazard method has now been altered to accept a Record of the same properties.\n  • New method addTags now accepts both Block and Item tags with the use of a Record. This removes addBlockTags and addItemTags.",
    "4.12.78": "Fixed a possible crash with the height Golems can step up by."
  },

  "promos": {
    "1.12.2-latest": "1.5",
    "1.12.2-recommended": "1.5",
    "1.13.2-latest": "2.2",
    "1.13.2-recommended": "2.2",
    "1.14.2-latest": "2.3",
    "1.14.2-recommended": "2.3",
    "1.14.3-latest": "2.4",
    "1.14.3-recommended": "2.4",
    "1.14.4-latest": "2.8",
    "1.14.4-recommended": "2.8",
    "1.15.2-latest": "3.1",
    "1.15.2-recommended": "3.1",
    "1.16.2-latest": "4.1",
    "1.16.2-recommended": "4.1",
    "1.16.3-latest": "4.4",
    "1.16.3-recommended": "4.4",
    "1.16.5-latest": "4.5",
    "1.16.5-recommended": "4.5",
    "1.17.1-latest": "4.6.1",
    "1.17.1-recommended": "4.6.1",
    "1.18-latest": "4.7",
    "1.18-recommended": "4.7",
    "1.18.2-latest": "4.8.1",
    "1.18.2-recommended": "4.8.1",
    "1.19-latest": "4.9.13",
    "1.19-recommended": "4.9.13",
    "1.19.3-latest": "4.10.41",
    "1.19.3-recommended": "4.10.41",
    "1.19.4-latest": "4.11.56",
    "1.19.4-recommended": "4.11.56",
    "1.20-latest": "4.12.76",
    "1.20-recommended": "4.12.76"
  }
}