{
  "homepage": "https://minecraft.curseforge.com/projects/nifty",
  "1.12.2": {
    "1.2": "• Whoops, that was not Vanilla, that looks more like Twilight Forest compatibility.\n     • Ironwood Fences, Stairs, and Slabs. For those who want more than wood, but less than iron.\n     • Fiery Fences, Stairs, and Slabs. It's perfect for heating your home during Winter!\n     • Steeleaf Fences, Slabs, and Stairs. It's the natural alternative for fine steel!\n     • Arctic Fur Fences, Slabs, and Stairs. The soft and cushiony blocks are perfect for those who are a little faithful to the leap.\n    • Carminite Fences, Slabs, and Stairs. Whatever it is, how well does it bode as something durable?\n    • As a note, these blocks will persist without Twilight Forest installed. This is perfectly normal behaviour.\n • Silly me, that wasn't the right thing to put into the Mod Info. The players are aware that this version is for 1.12.2, but what about the mod itself?\n • Maybe I should let players know what to expect in updates to this mod?",
    "1.3": "Here, have an early Christmas present.\n • Added Coal Stairs, Slabs, and Fences. Only for the naughtiest builders, but viable Furnace fuel.\n • Added Redstone Stairs, Slabs, and Fences. Each with their own emission rates, I want to see some clever Redstone builds.\n • Added ■■■■■■■■■ Stairs, Slabs, and Fences. Wait, what's happening?\n • Couple more behind the scenes changes that nobody should really care about.",
    "1.4": "New year, new stuff for Nifty.\n • Added Nifty Fence Gates and gave them to each material. Now you have a compliment for that farm with Nifty Fencing.\n • Added Nifty Trapdoors and gave them to each material. Some of them won't budge without encouragement, others will slip right open, like traps.\n • Fixed Ironwood Nifty Blocks being usable as Furnace fuel, because apparently anything wooden is fuel in Minecraft.\n • For various reasons, I have removed any Twilight Forest Textures that weren't the two 'safe' textures. You'll now get Missing Nifty Textures when Twilight Forest isn't installed.\n • Not that anyone should care, but I made tidier code.",
    "1.5": "Yeah, now I'm really picking up where Mojang left off.\n • Added Dirt Nifty Blocks. Start out your flaunting adventure by pimping up your Dirt house.\n • Added Grass Nifty Blocks. A greener alternative to Dirt houses, and self-sustaining.\n • Grass and Dirt Nifty blocks don't decay or grow, so they maintain their form in builds. To change between the two, use a Shovel or Bone Meal.\n • Added Hay Nifty Blocks. I'm surprised there wasn't some sort of Hay Stairs or Hay Slab in Minecraft already; now I know.\n • By popular demand and asked by nobody, added Clay Nifty Blocks. They were already a thing in 2.1, but I'll bring it here.\n • I may have gone a little far, and decided to add The Betweenlands compat. This includes Octine, Syrmorite, Valonite, Scabyst, and Sulfur Nifty Blocks.\n • Fixed Nifty Slab behaviour. They didn't drop anything if they were full blocks, and pick-blocking a full block yielded nothing.\n • All this time I was doing the Nifty Trapdoor recipes wrong.\n • I want to brag about how much rewriting I did in the background because it looks good, but nobody really cares."
  },
  "1.13.2": {
    "2.0": "Nifty is now out for 1.13.2! Currently, this is just a port of Nifty from 1.12.2, so nothing new has been added. Support for ConnectedTexturesMod and Twilight Forest have been removed as they are not on this version as of publishing. THIS IS NOT A RIFT MOD, PLEASE USE FORGE.",
    "2.1": "• Added Clay Stairs, Slabs, Fences, Trapdoors, and Fence Gates. Nifty was feeling out of balance, so this should fix it up.\n • Removed some leftover console prints. Those were from creating a new project and served no purpose.\n • Guess what? More things I did in the background that nobody should really care about.",
    "2.2": "Still taking up from where Mojang left off here.\n • Added Dirt Nifty Blocks. Start out your flaunting adventure by pimping up your Dirt house.\n • Added Grass Nifty Blocks. A greener alternative to Dirt houses, and self-sustaining.\n • Grass and Dirt Nifty blocks don't decay or grow, so they maintain their form in builds. To change between the two, use a Shovel or Bone Meal.\n • Added Hay Nifty Blocks. I'm surprised there wasn't some sort of Hay Stairs or Hay Slab in Minecraft already; now I know.\n • All this time I was doing the Nifty Trapdoor recipes wrong.\n • I want to brag about how much rewriting I did in the background because it looks good, but nobody really cares."
  },
  "1.14.2": {
    "2.3": "Nifty is now out for 1.14.2! Some textures have been adjusted slightly to fit with the new texture update, but they should be relatively similar to the classic textures. This is just a port of Nifty from 1.13.2, so no new features, and mod compat is still excluded for now. THIS IS NOT A FABRIC MOD. PLEASE USE FORGE."
  },
  "1.14.3": {
    "2.4": "Nifty is now out for 1.14.3! This is mostly just porting up a version, but also includes a couple fixes. First being that later versions of Forge would break the Grass Nifty blocks with their color. The second being that Grass Trapdoors weren't dropping because of an error in the loot table. No new features just yet."
  },
  "1.14.4": {
    "2.5": "Nifty is now out for 1.14.4! Unlike the last couple updates, this does include new features.\n • Added Grass Path Stairs, Slabs, Fences, Trapdoors, and Fence Gates. This one's by popular demand, and most certainly a necessity for 1.14.\n   • Nifty Grass Path blocks are obtained by using a Shovel on any Grass Nifty block. They will keep their form until a Hoe is used on them, where they will revert back to Nifty Grass blocks.\n    • Because of this new feature, obtaining Dirt Nifty blocks now require using a Hoe instead of a Shovel.\n   • As mentioned eariler, Grass Path Nifty blocks will keep their form until a Hoe is used on them, for building convenience.\n • Fixed an issue with Fence blocks not connecting to each other. I'm still not great with this whole datapack thing.\n • The behind-the-scenes tweaks are back, and nobody is required to care still."
  },
  "promos": {
    "1.12.2-latest": "1.5",
    "1.12.2-recommended": "1.5",
    "1.13.2-latest": "2.2",
    "1.13.2-recommended": "2.2",
    "1.14.2-latest": "2.4",
    "1.14.2-recommended": "2.4",
    "1.14.3-latest": "2.4",
    "1.14.3-recommended": "2.4",
    "1.14.4-latest": "2.5",
    "1.14.4-recommended": "2.5"
  }
}